/*******************************************************************************************************************************//**
 *
 * @file		HCSR04.h
 * @brief		Clase del sensor ultrasónico HCSR04
 * @date		22 jun. 2022
 * @author		Técnico. Martinez Agustin
 *
 **********************************************************************************************************************************/
#ifndef HCSR04_H_
#define HCSR04_H_

/*	SENSOR ULTRASÓNICO HC-SR04
 *
 * 	Se le debe enviar PWM de 60ms o  más (recomendamos 80) con un tiempo de encendido de 10us.
 * 	Recebirá otro pulso variable que debe ser leído por tx.
 *
 *	Devuelve el valor de distancia en cm (centímetros)
 */

/***********************************************************************************************************************************
 *** INCLUDES GLOBALES
 **********************************************************************************************************************************/
#include "pwmIn.h"
#include "PWM.h"
#include "distancia.h"
/***********************************************************************************************************************************
 *** DEFINES GLOBALES
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 *** MACROS GLOBALES
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 *** TIPO DE DATOS GLOBALES
 **********************************************************************************************************************************/

/***********************************************************************************************************************************
 *** IMPLANTACION DE LA CLASE
 **********************************************************************************************************************************/
class HC_SR04 : protected distancia
{
	private:
		#define PERIODO					80		/*En milisegundos*/
		#define CALC_DISTANCIA(a)		( ((a)*164) / 10000 )
	public:
		#define DISTANCIA_MAX	400		/*en centimetros*/
	private:
		pwmIn	* m_rx;
		Pwm		* m_tx;
		uint32_t m_distancia;
		bool m_stop;

	public:
		HC_SR04( pwmIn * rx , Pwm * tx );
		void Inicializar( void );
		uint32_t GetDistancia( void );
		void Off( void );
		void On( void );
		bool operator==( const uint32_t a);
		bool operator<=( const uint32_t a );
		bool operator>=( const uint32_t a );
		bool operator<( const uint32_t a );
		bool operator>( const uint32_t a );
		virtual ~HC_SR04(){};
};

#endif /* HCSR04_H_ */
